{
  "Rajinder Da Dhaba": {
    "rating": 4.2,
    "user_ratings_total": 49964,
    "address": "AB-14B, नौरोजी नगर मार्ग, opposite Safdarjung Enclave, Block A 1, Nauroji Nagar, Safdarjung Enclave, New Delhi, Delhi 110029, India",
    "price_level": 2,
    "google_maps_url": "https://maps.google.com/?cid=3134795068953005725",
    "website": "https://www.rajinderdadhaba.in/",
    "review_snippets": [
      "We ordered galoti kabab, butter chicken, mutton rogan josh, dal makhani, paneer butter masala with naan. Out of these, kabab and butter chicken were the best and perfectly cooked. The rest were good too but these two stood out.\n\nThe service could be better. We were 5 people but when we started giving our order the waiter kept asking us to order less in a tone that was little rude and she was insisting it again and again which got irritating after a point. I understand that it is their job to help us with the quantity but she could have been a little more polite.\n\nI wanted to give 5 star to the place but because of the staff behaviour and service experience I am giving it 3 stars.",
      "Non vegetarian dishes are excellent in this restaurant. They have different self service sections for kabaab, gravy, breads etc. Table service is also available in 2.0 section and advisable for the new comers though little costlier than the self service section. ♿️❌",
      "It's very good Dhaba but if you will sit in restaurants of this Dhaba you will feel disappointed as we ordered fish curry which was simply prepared in the gravy of chicken masala\nBut the dal makhani tawa fish with vegetables are my favourite dishes here\nOverall very good"
    ]
  },
  "Indian Accent": {
    "rating": 4.7,
    "user_ratings_total": 9059,
    "address": "The Lodhi, Lodhi Rd, CGO Complex, Pragati Vihar, New Delhi, Delhi 110003, India",
    "price_level": 4,
    "google_maps_url": "https://maps.google.com/?cid=18235984543408532518",
    "website": "https://indianaccent.com/newdelhi",
    "review_snippets": [
      "The food was truly delicious. The attention to detail as you can see in the pictures attached. There was 3 of us and we each got the non veg chef's tasting menu. At the end of the meal the head chef came out and talked to us and answered any questions we had. Truly an amazing experience and I would 100% recommend this place. If I'm ever in deli again I will visit this place for sure.",
      "An amazing experience! We tried the chef tasting menu V and most of the items were amazing!\n\nThis 6 course menu comes with a lot of bite sized food, but overall it makes you full. In my opinion, the dessert was the best!",
      "Indian Accent: A Culinary Journey! ✨\nThis place is pure magic! 🪄 The tasting menu is a rollercoaster of flavors. Initially, I was skeptical about the small portions, but the main course was a delightful surprise! Every bite was a new adventure. Highly recommend for food lovers! 🤤\n\n#IndianAccent #foodieheaven #tastingmenu"
    ]
  },
  "Olive Bar & Kitchen": {
    "rating": 4.6,
    "user_ratings_total": 9213,
    "address": "Mile 6, One Style, 8, Kalka Das Marg, Seth Sarai, Mehrauli, New Delhi, Delhi 110030, India",
    "price_level": 4,
    "google_maps_url": "https://maps.google.com/?cid=768574053477456863",
    "website": null,
    "review_snippets": [
      "We went for dinner. The service was really good and fast. We ordered gluten and lactose free dishes. There were quite less options under that category but they tasted nice. The ambience was perfect for dinner with candle lights. The music or live music would have been better.",
      "The high price is for the Ambiance and of course curated dishes. But if you go on weekends then the service is in confusion. So go on a week day to enjoy the service also.\n\nThe drinks were nice. But the food portions are small so order accordingly. I ordered a Chicken soup which was too pungent to drink …. Had to leave it. The pasta was nice and also the chicken dish. A place for a one time visit.",
      "Amazing ambience and a plethora of specially curated dishes. The service is superb and the staff is courteous and prompt.\n\nWe went over a weekend so there a lot & lot of crowd. The staff were on their toes, smiling and attending to the guests.\n\nWould suggest all to go on a weekday.\n\nThe drinks were nice and the food portions are good too.\n\nWe ordered a veg mezze 🫒 platter and a pizza. The platter was good but the pizza was amazing. Thin crust with juicy tomatoes.\n\nMocktails are amazing too\n\nMust visit\n\nLocated almost opposite to Qutub Minar"
    ]
  },
  "Megu Restaurant": {
    "rating": 4.7,
    "user_ratings_total": 5616,
    "address": "The Leela Palace, Africa Ave, Diplomatic Enclave, Chanakyapuri, New Delhi, Delhi 110023, India",
    "price_level": 4,
    "google_maps_url": "https://maps.google.com/?cid=16452330304916083974",
    "website": "https://www.theleela.com/the-leela-palace-new-delhi/restaurants/megu",
    "review_snippets": [
      "Excessively Priced!!\nNot an authentic Japanese restaurant, they serve fusion food. The udon noodles tastes more like an Indian Chinese dish. The grilled prawns consists of just 3 pcs of prawns split open and served shelled with some seasoning.\n\nThey have lot of vegetarian options and some selected non vegetarian food.\n\nThe dishes are priced very high and the portions meagre (we left feeling hungry !!).",
      "Authentic Japanese doesn't get better than this.\n\nInside the Leela ,the place oozes of japanese autheticity from moment you walk in. The glass budha statue right in the middle of the dinning area the place adds a soothing touch to whole experience.\n\nWith alcohol  from all parts of japan and world there something for everyone.\n\nWe started with Tuna Tataki as cold appetizers and Megu's Shrimpop as hot appetizers.  Tuna tataki was amazing the shrimpop were just ok.\n\nNext on the table prawn nilgiri sushi roll, it was one of the best we ever had, in mains we ordered Grilled Prawn and grilled baby chicken. chicken we found to be on the sweeter end of the spectrum.\n\nThe highlight of the day was the Azuki Almond crumble tart, just amazing and should never be missed\n\nA definite recommendation for japanese/Asian fine dine for your special occasions.",
      "We ordered 4 items out of which only yellowtail sushi roll was fine. Their salmon grilled which cost 2.7 k comes with just a tiny 4 piece and it was stale one. Once we cut it open, we can get that strong rotten smell. Their chicken yakitori is just a tiny 6 piece of normal fried chicken which we can get anywhere. Their chicken fried rice is a burnt rice which was very bitter when eat. The ambience and service is good. But i dont recommend to anyone. Im wondering how come they receive many awards. Must involve some politics maybe or paying people to vote for them. All the dishes they serve have no specialty. Just normal dish you can get evrywhere in delhi. And yeah you wont get full after you spend 6.5 k also because its very tiny amount of wahtever they serve. So think it nicely"
    ]
  },
  "Bukhara": {
    "rating": 4.5,
    "user_ratings_total": 8760,
    "address": "ITC MAURYA, Sardar Patel Marg, Akhaura Block, Diplomatic Enclave, Chanakyapuri, New Delhi, Delhi 110021, India",
    "price_level": 4,
    "google_maps_url": "https://maps.google.com/?cid=11128754767225469245",
    "website": "https://www.itchotels.com/in/en/itcmaurya-new-delhi",
    "review_snippets": [
      "A good hotel experience review often highlights a combination of factors like a beautiful and clean room, a great location, excellent service, and value for money. Guests appreciate friendly and helpful staff, especially those at the front desk and room service, and may single out individuals who went above and beyond. Positive reviews also frequently mention the overall atmosphere, the quality of food, and the ease of access to nearby attractions.\n\nKey aspects of a positive hotel experience review:\n\nCleanliness and comfort:\n\nReviews often mention the cleanliness of the rooms and the comfort of the bedding and amenities.\n\nLocation:\n\nA convenient location for sightseeing or access to other amenities is highly valued.\n\nService:\n\nPositive reviews often highlight the helpfulness and friendliness of the staff, particularly those at the front desk and room service.\n\nValue for money:\n\nGuests appreciate a good value, where the price aligns with the quality of the experience.\n\nOverall atmosphere:\n\nA pleasant and inviting atmosphere contributes to a positive overall experience.",
      "I am giving overall 3 star rating due to below reasons\n1. They force you to go for fixed menu, instead of ala carte so that they can generate maximum revenue per table. This is enethical practice, we should have an option to select either options as they are provided by restaurant.\n2. The service is very slow, it takes multiple reminders and followup to order drinks and other things. If u r charging and exorbitant money (around 10k per person), u should deploy a dedicated waiter per table.\n3. The sitting arrangement is very uncomfortable, they gave stools and benches. Moreover they have literally placed a table and chair in every possible space available. One of our guest was not able to even sit properly because his knees were touching the table due to less space.\n3. Some of the good items are average, like mutton raan, which is part of fixed menu. If u ask them to replace it with some other mutton items, they charge extra for that. Since u r charging 8k plus taxes already for fixed non veg menu, why u don't give options to choose the dishes, specially they are part of your fixed menu.\n\nThey god fame and and now they are misusing that market position in order to maximise their revenue, while completely ignoring the customer care and sevice. You can't run such business just on the fame for long time.",
      "An Unforgettable Culinary Experience!\nBukhara is truly a gem when it comes to North Indian cuisine. From the moment you walk in, the rustic yet elegant decor sets the tone for an authentic dining experience. The ambiance is warm and inviting, with traditional seating and beautiful copper cutlery that enhances the cultural vibe.\n\nThe food was absolutely delicious — rich, flavorful, and cooked to perfection. Each dish felt like it had a story to tell. The service was impeccable too; the staff was courteous, knowledgeable, and ensured that every need was met promptly.\n\nThough it’s on the premium side (₹2000+), the quality, presentation, and experience make it completely worth it. Highly recommend for special occasions or for anyone who truly wants to enjoy the essence of North Indian food.\n\nWill definitely be coming back again!"
    ]
  },
  "AnnaMaya FoodHall - Andaz Delhi": {
    "rating": 4.6,
    "user_ratings_total": 4629,
    "address": "Ground Floor, Asset No.1, Aerocity, New Delhi, Delhi 110037, India",
    "price_level": 3,
    "google_maps_url": "https://maps.google.com/?cid=9007897470896350476",
    "website": "https://www.hyatt.com/andaz/delaz-andaz-delhi/dining",
    "review_snippets": [
      "Annamaya at Hyatt Andaz offers a delightful culinary experience, serving flavorful traditional Indian dishes along with a variety of multi-cuisine options—all in a stylish, contemporary setting. Conveniently located in Aerocity, just off the route from the airport, the restaurant boasts ample parking, making it easily accessible.\n\nOne of the highlights is the impressive open kitchen, where you can watch the chefs in action—an inviting and lively sight that sets the tone for what’s to come.\n\nWe started with a platter of assorted kebabs, which was absolutely outstanding. Served with a fresh, aromatic coriander chutney, each bite was bursting with flavor. For the main course, we ordered saag paneer, butter chicken, wok-fried rice, lachha paratha, and tandoori rotis. Every dish was beautifully presented, generously portioned, and packed with rich, balanced flavors. The level of spice was perfect—even our kids thoroughly enjoyed the meal.\n\nOverall, Annamaya delivered an exceptional dining experience in the heart of Hyatt Andaz. Highly recommended for anyone looking for top-notch food in a chic and welcoming atmosphere.",
      "Planning for a brunch, then AnnaMaya is superb.\n1. Authentic Korean food\n2. Authentic Mughlai\n3. Limited for mocktail. Best mocktail Pink panther\n4. Plenty option for cocktails",
      "AnnaMaya’s Comeback Story: From Ghost Town to Gourmet Glory!\n\nOnce upon a time, AnnaMaya was my go-to food heaven in India—a place I’d happily drop in solo or with family and leave fully satisfied (and maybe a little spoiled). But alas, like a hero in a drama, it went through a rough patch. The food lost its magic, service slowed to a snail’s pace, and the whole vibe felt like a ghost town. Needs a background music 🎶\n\nBut guess what? On my latest visit with my daughter, I spotted a shining light at the end of the tunnel. Could AnnaMaya be making a comeback? Spoiler alert: yes!\n\nWe kicked off with the vegetarian dumpling soup, which was pretty good (not blowing any minds, but comforting enough).\n\nThen came the main event: dal Makhani, rice, and butter garlic naan. Now, the naan was a little chewy—probably schuld to the maida—but the dal Makhani? Absolute knockout! So authentic and delicious, it brought a tear to my eye.\n\nNow, here’s the real plot twist: the service! It wasn’t just “good enough.” It was back to that warm, attentive vibe from the glory days. Special shout out to Shubham, who, when the kitchen was out of masala chai (the horror!), personally brewed a fresh cup just for me. And Himanshu, our server, kept everything running smoothly.\n\nOnly hitch? The food took some time to arrive. But hey, I’m choosing to believe it’s because everything was made fresh and with love.\n\nSo, cheers to AnnaMaya’s comeback! May the dal flow forever, and the service keep shining bright. Drum 🥁 rolls please 🎶"
    ]
  },
  "Temple Street - Ashok Nagar Delhi - Pure Veg Restaurant": {
    "rating": 4.6,
    "user_ratings_total": 3406,
    "address": "58, Block 59, Block 58, 1, Mukund Lal Katyal Marg, Block 59, Block 58, Ashok Nagar, New Delhi, Delhi, 110018, India",
    "price_level": 2,
    "google_maps_url": "https://maps.google.com/?cid=9161910648090741597",
    "website": "https://templestreet.in/",
    "review_snippets": [
      "I visited Temple Street today and had an incredible dining experience! The Jumbo Platter was a great choice, offering a delicious sampling of three starters, Dal Makhni, Nan, and Gulab Jamun. Each component was expertly prepared and full of flavor.\nThe authentic Masala Dosa was another highlight - crispy, savory, and utterly satisfying.\nTo drink, I tried the Caramel Bubble Tea, which was sweet and refreshing.\nOverall, Temple Street truly delivers on authentic flavors and generous portions. Highly recommend!",
      "Highly recommend the Navaratri Sabudana Khichdi here, it was flavorful and delicious. We also had the Bedmi poori platter that we loved. The Laccha paratha was good but not extraordinary. Service was fast, efficient, kind and friendly. The place is clean, hygienic and they keep the flies in check. We will return for sure.",
      "The place has amazing vibes with delicious and authentic flavours. We went for their South indian cuisine, and that was absolutely fantastic. If you're searching for some budget friendly cafe with good food, then I would highly recommend this place."
    ]
  },
  "Tamra Restaurant": {
    "rating": 4.4,
    "user_ratings_total": 5288,
    "address": "Level 1 Shangri-La Eros New Delhi, 19, Ashoka Rd, Janpath, Connaught Place, New Delhi, Delhi 110001, India",
    "price_level": 3,
    "google_maps_url": "https://maps.google.com/?cid=17186238788506427936",
    "website": "http://www.shangri-la.com/newdelhi/erosshangrila/dining/restaurants/tamra/",
    "review_snippets": [
      "This restaurant is mind blowing.. I have there more than 10 times and every time my experience was changed to be best then better. The food is fresh made and so delicious. Good work Tamra ..",
      "One of the most authentic and best restaurant I have ever visited. The interiors are really nice! Tamra is a perfect place for dinner date and they offer wide range of food to choose from as it is a buffet system.",
      "The restaurant offers both excellent food and a delightful ambiance. Each dish was well-cooked and full of flavor. The atmosphere is warm, inviting, and enhances the overall dining experience. Definitely worth visiting again"
    ]
  },
  "Kake Di Hatti": {
    "rating": 4.1,
    "user_ratings_total": 10963,
    "address": "Church Mission Rd, Cloth Market, Katra Ghel, Khari Baoli, Chandni Chowk, New Delhi, Delhi, 110006, India",
    "price_level": 2,
    "google_maps_url": "https://maps.google.com/?cid=12986868378657776135",
    "website": "http://www.kakedihatti.com/",
    "review_snippets": [
      "I recently visited Kake di Hatti after 7 years, and I was pleasantly surprised by the transformation! This iconic spot, known for its rich legacy and mouth-watering North Indian food, has expanded beautifully. They’ve opened new venues right across from the old shop—now it’s more spacious, well-maintained, hygienic, and air-conditioned, making the dining experience even better.\n\nThe food is still as delicious as ever. I tried their famous King of Naan—and true to its name, it was massive! Three of us couldn’t finish it together. It’s a must-try!",
      "Kake di Hatti is legendary for one thing: insanely authentic North Indian flavours, especially their naan! The unique part? You choose your vibe. Their original section is pure, bustling nostalgia - a true taste of their history. Or, opt for their clean, modern dining space. Whichever you pick, the star is the same incredible, time-tested food. Ambience differs, but the iconic taste remains consistently fantastic.",
      "I recently visited Kake Di Hatti and tried their Aalu Naan, Simple Naan, Paneer Butter Masala, and Kadhai Paneer. All these dishes were absolutely fantastic – rich flavours, authentic taste, and fresh preparation. The Paneer Butter Masala and Kadhai Paneer were perfectly cooked with creamy and spicy gravies that paired well with the naans.\n\nI also tried their Paneer Tikka. It was decent in taste with a good quantity and soft paneer, though I felt it could have been slightly better in terms of flavour punch. Still, it was enjoyable.\n\nThe service was good, staff were polite and quick, and the atmosphere was vibrant and traditional, giving an old Delhi charm. Overall, it’s a very good restaurant with the best food quality in Chandni Chowk for North Indian cuisine. It may not feel luxurious but it delivers great value for money with filling portions and authentic taste.\n\nDefinitely a must-try if you want to experience Delhi’s famous Punjabi food with a homely touch. Will visit again soon!"
    ]
  },
  "QD": {
    "rating": 4.3,
    "user_ratings_total": 5627,
    "address": "i -1A, Block I, Lajpat Nagar II, Lajpat Nagar, New Delhi, Delhi 110024, India",
    "price_level": 2,
    "google_maps_url": "https://maps.google.com/?cid=15594246595012880225",
    "website": null,
    "review_snippets": [
      "I recently visited QD in Lajpat Nagar, and overall, it was a pleasant experience. We mostly had the Chinese platter, which included spring rolls, Manchurian, and cheesy mushrooms. The mushrooms were decent, but the spring rolls and Manchurian were definitely the highlights—they were flavorful and well-prepared. We also tried the Dahi ke Kebab, which was delicious and had a great texture. For the tandoori platter, the soyachap stood out, being incredibly soft and tender. Although it wasn’t the absolute best, the food was quite enjoyable, and I would recommend giving it a try for anyone in the area.",
      "We visited QD for the first time and I must say its a must visit!! The food quality is top notch and the ingredients are fresh. The drinks were so refreshing. And unlike the unhealthy mayo sauce etc, they serve good quality and healthy dips with their platters. We tried the shawarma platter and it was too good. The staff is very jovial and nice. We would definitely go back to this gem of a place.",
      "Visited Qd’s with my siblings yesterday and we had a great time. With delicious food, great ambience & friendly staff we always love visiting Qd’s. We ordered their devil peri peri momos sizzler, Cheesy Afghani Sizzled, Rum kissed Mamarosa Sizzlr Pasta, Belly Buster platter & their Triple Chocolate Pancake (so good😍). We also tried their refreshing mocktail tote bag suitable to a group of 3/4 people. Overall we had an amazing experience. So highly recommended ! Do visit with your friends and family."
    ]
  }
}